# Explore here

We are going to focus on Lake_Bilancino for this exercise. Do and EDA and Build a Model.

In [12]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

# Load Lake Bilancino dataset
df = pd.read_csv('/workspaces/Time-Series-Marcel/data/acea-water-prediction/Lake_Bilancino.csv')

# Display the first few rows of the dataset
df.head()

,Date,Rainfall_S_Piero,Rainfall_Mangona,Rainfall_S_Agata,Rainfall_Cavallina,Rainfall_Le_Croci,Temperature_Le_Croci,Lake_Level,Flow_Rate
0,03/06/2002,NaN,NaN,NaN,NaN,NaN,NaN,249.43,0.31
1,04/06/2002,NaN,NaN,NaN,NaN,NaN,NaN,249.43,0.31
2,05/06/2002,NaN,NaN,NaN,NaN,NaN,NaN,249.43,0.31
3,06/06/2002,NaN,NaN,NaN,NaN,NaN,NaN,249.43,0.31
4,07/06/2002,NaN,NaN,NaN,NaN,NaN,NaN,249.44,0.31

In [14]:
# Drop not useful columns
df_Bilancino = df.drop(['Rainfall_S_Piero', 'Rainfall_Mangona', 'Rainfall_S_Agata', 'Rainfall_Cavallina', 'Rainfall_Le_Croci', 'Temperature_Le_Croci'], axis=1)

df_Bilancino.head()

         Date  Lake_Level  Flow_Rate
0  03/06/2002      249.43       0.31
1  04/06/2002      249.43       0.31
2  05/06/2002      249.43       0.31
3  06/06/2002      249.43       0.31
4  07/06/2002      249.44       0.31

In [15]:
# Check for missing values
print(df_Bilancino.isnull().sum())

Date           0
Lake_Level     0
Flow_Rate     21
dtype: int64

In [16]:
# Drop Null values in Flow_rate column
df_clean = df_Bilancino.dropna(subset=['Flow_Rate'])

print(df_clean.isnull().sum())

Date          0
Lake_Level    0
Flow_Rate     0
dtype: int64